In [35]:
class Image:
    def __init__(self,oci_instance):
        self.oci_instance = oci_instance
        print(self.oci_instance.f1()) # (A)
class OCI:
    def f1(self):
        self.compartment_id = 'compartmentID'
        return self.compartment_id

image = Image(OCI())
#print(image.compartment_id) # (B) ->Error

compartmentID

In [37]:
import numpy as np

# Initialize the 2D array of shape (4, 4)
x = np.array([[1, 2, 3, 4],
              [5, 6, 7, 8],
              [9, 10, 11, 12],
              [13, 14, 15, 16]])

y = 3

result_array = x * y
print(result_array)

[[ 3  6  9 12]
 [15 18 21 24]
 [27 30 33 36]
 [39 42 45 48]]

In [ ]:
16 
1x16=16
2x8=16
8x2=16

In [39]:
result_array.reshape(1,16)

array([[ 3,  6,  9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48]])

In [41]:
result_array.reshape(2,8)

array([[ 3,  6,  9, 12, 15, 18, 21, 24],
       [27, 30, 33, 36, 39, 42, 45, 48]])

In [43]:
result_array.reshape(8,2)

array([[ 3,  6],
       [ 9, 12],
       [15, 18],
       [21, 24],
       [27, 30],
       [33, 36],
       [39, 42],
       [45, 48]])

In [45]:
x.size

16

In [47]:
import pandas as pd

In [49]:
pd.read_csv('emp.csv')

   eid    ename  edept   eplace  ecost
0  101      ram  sales     pune   1000
1  102      leo   prod   bglore   2000
2  103      anu     HR      hyd   3000
3  104     paul  sales   bglore   3200
4  423      zio  sales     pune   3420
5  142      anu   prod  chennai   4300
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [51]:
df1 = pd.read_csv('emp.csv',index_col=0)
df1

       ename  edept   eplace  ecost
eid
101      ram  sales     pune   1000
102      leo   prod   bglore   2000
103      anu     HR      hyd   3000
104     paul  sales   bglore   3200
423      zio  sales     pune   3420
142      anu   prod  chennai   4300
949  karthik  sales   bglore   3100
848      tom     hr  chennai   3940
931    vijay   prod  chennai   3411

In [53]:
df1.loc[142]

ename         anu
edept        prod
eplace    chennai
ecost        4300
Name: 142, dtype: object

In [55]:
df1.drop(142) # remove 142 eid records

       ename  edept   eplace  ecost
eid
101      ram  sales     pune   1000
102      leo   prod   bglore   2000
103      anu     HR      hyd   3000
104     paul  sales   bglore   3200
423      zio  sales     pune   3420
949  karthik  sales   bglore   3100
848      tom     hr  chennai   3940
931    vijay   prod  chennai   3411

In [57]:
df1

       ename  edept   eplace  ecost
eid
101      ram  sales     pune   1000
102      leo   prod   bglore   2000
103      anu     HR      hyd   3000
104     paul  sales   bglore   3200
423      zio  sales     pune   3420
142      anu   prod  chennai   4300
949  karthik  sales   bglore   3100
848      tom     hr  chennai   3940
931    vijay   prod  chennai   3411

In [59]:
d={"K1":[10,20,30],"K2":[15,25,35],"K3":[1,2,3]}

df2 = pd.DataFrame(d)
df2

   K1  K2  K3
0  10  15   1
1  20  25   2
2  30  35   3

In [61]:
df2.drop(1)

   K1  K2  K3
0  10  15   1
2  30  35   3

In [65]:
df2.drop(columns='K2')

   K1  K3
0  10   1
1  20   2
2  30   3

In [67]:
df2

   K1  K2  K3
0  10  15   1
1  20  25   2
2  30  35   3

In [69]:
df2.drop(columns=['K2','K3'])

   K1
0  10
1  20
2  30

In [71]:
df1

       ename  edept   eplace  ecost
eid
101      ram  sales     pune   1000
102      leo   prod   bglore   2000
103      anu     HR      hyd   3000
104     paul  sales   bglore   3200
423      zio  sales     pune   3420
142      anu   prod  chennai   4300
949  karthik  sales   bglore   3100
848      tom     hr  chennai   3940
931    vijay   prod  chennai   3411

In [73]:
df1.drop(columns=['edept','ecost'])

       ename   eplace
eid
101      ram     pune
102      leo   bglore
103      anu      hyd
104     paul   bglore
423      zio     pune
142      anu  chennai
949  karthik   bglore
848      tom  chennai
931    vijay  chennai

In [75]:
df1.rename(columns={'eplace':'WorkingPlace'})

       ename  edept WorkingPlace  ecost
eid
101      ram  sales         pune   1000
102      leo   prod       bglore   2000
103      anu     HR          hyd   3000
104     paul  sales       bglore   3200
423      zio  sales         pune   3420
142      anu   prod      chennai   4300
949  karthik  sales       bglore   3100
848      tom     hr      chennai   3940
931    vijay   prod      chennai   3411

In [77]:
df2

   K1  K2  K3
0  10  15   1
1  20  25   2
2  30  35   3

In [79]:
df2.drop(columns='K2')

   K1  K3
0  10   1
1  20   2
2  30   3

In [81]:
del(df2['K2'])

In [83]:
df2

   K1  K3
0  10   1
1  20   2
2  30   3

In [85]:
df2

   K1  K3
0  10   1
1  20   2
2  30   3

In [87]:
df2.rename(columns={'K3':'Field3'})

   K1  Field3
0  10       1
1  20       2
2  30       3

In [89]:
df2

   K1  K3
0  10   1
1  20   2
2  30   3

In [ ]:
# inplace=True 
# delete,rename.... //

In [93]:
df2

   K1  K3
0  10   1
1  20   2
2  30   3

In [95]:
df2.rename(columns={'K3':'Field3'})

   K1  Field3
0  10       1
1  20       2
2  30       3

In [97]:
df2

   K1  K3
0  10   1
1  20   2
2  30   3

In [99]:
df2.rename(columns={'K3':'Field3'},inplace=True)

In [101]:
df2

   K1  Field3
0  10       1
1  20       2
2  30       3

In [103]:
d={"K1":[10,20,None],"K2":[15,None,None],'K3':[None,15,None]}
pd.DataFrame(d)

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  15.0
2   NaN   NaN   NaN

In [105]:
df3 = pd.DataFrame(d)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   K1      2 non-null      float64
 1   K2      1 non-null      float64
 2   K3      1 non-null      float64
dtypes: float64(3)
memory usage: 204.0 bytes

In [107]:
df3.isnull()

      K1     K2     K3
0  False  False   True
1  False   True  False
2   True   True   True

In [109]:
df3.isnull().sum()

K1    1
K2    2
K3    2
dtype: int64

In [111]:
df3.fillna('TestV3') # To replace null value fillna()

       K1      K2      K3
0    10.0    15.0  TestV3
1    20.0  TestV3    15.0
2  TestV3  TestV3  TestV3

In [113]:
df3

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  15.0
2   NaN   NaN   NaN

In [115]:
df3.fillna('TestV3',inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\2788979240.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'TestV3' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df3.fillna('TestV3',inplace=True)

In [117]:
df3

       K1      K2      K3
0    10.0    15.0  TestV3
1    20.0  TestV3    15.0
2  TestV3  TestV3  TestV3

In [119]:
d={"K1":[10,20,None],"K2":[15,None,None],'K3':[None,15,None]}
pd.DataFrame(d)

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  15.0
2   NaN   NaN   NaN

In [121]:
d['K1']

[10, 20, None]

In [125]:
df4=pd.DataFrame(d)
df4['K1']

0    10.0
1    20.0
2     NaN
Name: K1, dtype: float64

In [127]:
df4['K1'].fillna('TestData')

0        10.0
1        20.0
2    TestData
Name: K1, dtype: object

In [129]:
df4['K1'].fillna('TestData',inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\446521050.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'TestData' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df4['K1'].fillna('TestData',inplace=True)

In [131]:
df4

         K1    K2    K3
0      10.0  15.0   NaN
1      20.0   NaN  15.0
2  TestData   NaN   NaN

In [135]:
df4['K1']

0        10.0
1        20.0
2    TestData
Name: K1, dtype: object

In [137]:
df4[['K1','K3']]

         K1    K3
0      10.0   NaN
1      20.0  15.0
2  TestData   NaN

In [139]:
df4[['K1','K3']].fillna('SAMPLE')

         K1      K3
0      10.0  SAMPLE
1      20.0    15.0
2  TestData  SAMPLE

In [141]:
df4.duplicated()

0    False
1    False
2    False
dtype: bool

In [201]:
d={"K1":[10,10,30],"K2":[10,10,30],"K3":[10,10,30]}

pd.DataFrame(d)

   K1  K2  K3
0  10  10  10
1  10  10  10
2  30  30  30

In [203]:
pd.DataFrame(d).duplicated()

0    False
1     True
2    False
dtype: bool

In [205]:
pd.DataFrame(d).duplicated().sum()

1

In [157]:
pd.DataFrame(d).drop_duplicates()

   K1  K2  K3
0  10  10  10
2  30  30  30

In [177]:
d={"K1":[10,20,30],"K2":[15,None,None],'K3':[45,15,None],'K4':[1,2,3]}
pd.DataFrame(d)

   K1    K2    K3  K4
0  10  15.0  45.0   1
1  20   NaN  15.0   2
2  30   NaN   NaN   3

In [179]:
df4=pd.DataFrame(d)
df4.dropna() # remove the rows contains NaN (None) value

   K1    K2    K3  K4
0  10  15.0  45.0   1

In [181]:
df4

   K1    K2    K3  K4
0  10  15.0  45.0   1
1  20   NaN  15.0   2
2  30   NaN   NaN   3

In [183]:
df4.dropna(axis=1) # drop colums with any NaN Value

   K1  K4
0  10   1
1  20   2
2  30   3

In [185]:
df4.dropna(axis=0) # row based - default

   K1    K2    K3  K4
0  10  15.0  45.0   1

In [193]:
df4.dropna(thresh=3) # drop rows with < 3

   K1    K2    K3  K4
0  10  15.0  45.0   1
1  20   NaN  15.0   2

In [195]:
df4

   K1    K2    K3  K4
0  10  15.0  45.0   1
1  20   NaN  15.0   2
2  30   NaN   NaN   3

In [207]:
df_csv = pd.read_csv('emp.csv')
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   eplace  9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [209]:
df_csv.shape

(9, 5)

In [211]:
df_csv.duplicated().sum()

0

In [213]:
df_csv.drop_duplicates()

   eid    ename  edept   eplace  ecost
0  101      ram  sales     pune   1000
1  102      leo   prod   bglore   2000
2  103      anu     HR      hyd   3000
3  104     paul  sales   bglore   3200
4  423      zio  sales     pune   3420
5  142      anu   prod  chennai   4300
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [215]:
df_csv.drop_duplicates(inplace=True)

In [217]:
df_csv.duplicated().sum()

0

In [219]:
df_csv.isnull()

     eid  ename  edept  eplace  ecost
0  False  False  False   False  False
1  False  False  False   False  False
2  False  False  False   False  False
3  False  False  False   False  False
4  False  False  False   False  False
5  False  False  False   False  False
6  False  False  False   False  False
7  False  False  False   False  False
8  False  False  False   False  False

In [221]:
df_csv.isnull().sum()

eid       0
ename     0
edept     0
eplace    0
ecost     0
dtype: int64

In [231]:
#df_csv.fillna('SAMPLE') # global 
#df_csv['edept'].fillna('Common_DEPT') 
#df_csv[['edept','eplace']].fillna('CommonValue')

In [233]:
df_csv.columns

Index(['eid', 'ename', 'edept', 'eplace', 'ecost'], dtype='object')

In [235]:
df_csv.rename(columns={'edept':'Edept','ecost':'cost'})

   eid    ename  Edept   eplace  cost
0  101      ram  sales     pune  1000
1  102      leo   prod   bglore  2000
2  103      anu     HR      hyd  3000
3  104     paul  sales   bglore  3200
4  423      zio  sales     pune  3420
5  142      anu   prod  chennai  4300
6  949  karthik  sales   bglore  3100
7  848      tom     hr  chennai  3940
8  931    vijay   prod  chennai  3411

In [237]:
df_csv.drop(5)

   eid    ename  edept   eplace  ecost
0  101      ram  sales     pune   1000
1  102      leo   prod   bglore   2000
2  103      anu     HR      hyd   3000
3  104     paul  sales   bglore   3200
4  423      zio  sales     pune   3420
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [245]:
df_csv.drop([3,5])

   eid    ename  edept   eplace  ecost
0  101      ram  sales     pune   1000
1  102      leo   prod   bglore   2000
2  103      anu     HR      hyd   3000
4  423      zio  sales     pune   3420
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [254]:
df_csv.drop(columns=['edept','eplace'])

   eid    ename  ecost
0  101      ram   1000
1  102      leo   2000
2  103      anu   3000
3  104     paul   3200
4  423      zio   3420
5  142      anu   4300
6  949  karthik   3100
7  848      tom   3940
8  931    vijay   3411

In [256]:
df5=df_csv.drop(columns=['edept','eplace'])

In [272]:
len(df5.index)

9

In [276]:
[v for v in range(1,len(df5.index)+1)]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

df5.index = [v for v in range(9)]

In [278]:
df5.index = [v for v in range(1,len(df5.index)+1)]

In [280]:
df5

   eid    ename  ecost
1  101      ram   1000
2  102      leo   2000
3  103      anu   3000
4  104     paul   3200
5  423      zio   3420
6  142      anu   4300
7  949  karthik   3100
8  848      tom   3940
9  931    vijay   3411

In [282]:
#pd.read_csv()
df5.to_csv('df5.csv') # writing dataframe to file

In [284]:
pd.read_csv('df5.csv')

   Unnamed: 0  eid    ename  ecost
0           1  101      ram   1000
1           2  102      leo   2000
2           3  103      anu   3000
3           4  104     paul   3200
4           5  423      zio   3420
5           6  142      anu   4300
6           7  949  karthik   3100
7           8  848      tom   3940
8           9  931    vijay   3411

In [286]:
df6 = pd.read_csv('df5.csv')
print(df6.columns)

Index(['Unnamed: 0', 'eid', 'ename', 'ecost'], dtype='object')

In [298]:
#df6.rename({'Unnamed:0':'K1'})
df6.drop(columns='Unnamed: 0')

   eid    ename  ecost
0  101      ram   1000
1  102      leo   2000
2  103      anu   3000
3  104     paul   3200
4  423      zio   3420
5  142      anu   4300
6  949  karthik   3100
7  848      tom   3940
8  931    vijay   3411

In [300]:
df6.drop(columns='Unnamed: 0',inplace=True)

In [302]:
df6.columns

Index(['eid', 'ename', 'ecost'], dtype='object')

In [314]:
df6.sort_values(by='ename')

   eid    ename  ecost
2  103      anu   3000
5  142      anu   4300
6  949  karthik   3100
1  102      leo   2000
3  104     paul   3200
0  101      ram   1000
7  848      tom   3940
8  931    vijay   3411
4  423      zio   3420

In [316]:
df6.sort_values(by='ename',ascending=False)

   eid    ename  ecost
4  423      zio   3420
8  931    vijay   3411
7  848      tom   3940
0  101      ram   1000
3  104     paul   3200
1  102      leo   2000
6  949  karthik   3100
2  103      anu   3000
5  142      anu   4300

In [318]:
df6.sort_values(by='ecost',ascending=False)

   eid    ename  ecost
5  142      anu   4300
7  848      tom   3940
4  423      zio   3420
8  931    vijay   3411
3  104     paul   3200
6  949  karthik   3100
2  103      anu   3000
1  102      leo   2000
0  101      ram   1000

In [322]:
df6.sort_values(by=['ename','ecost'],ascending=[True,False])

   eid    ename  ecost
5  142      anu   4300
2  103      anu   3000
6  949  karthik   3100
1  102      leo   2000
3  104     paul   3200
0  101      ram   1000
7  848      tom   3940
8  931    vijay   3411
4  423      zio   3420

In [324]:
df6.sort_index()

   eid    ename  ecost
0  101      ram   1000
1  102      leo   2000
2  103      anu   3000
3  104     paul   3200
4  423      zio   3420
5  142      anu   4300
6  949  karthik   3100
7  848      tom   3940
8  931    vijay   3411

In [326]:
df6.sort_index(ascending=False)

   eid    ename  ecost
8  931    vijay   3411
7  848      tom   3940
6  949  karthik   3100
5  142      anu   4300
4  423      zio   3420
3  104     paul   3200
2  103      anu   3000
1  102      leo   2000
0  101      ram   1000

In [328]:
df1 = pd.DataFrame({'K1':[1,2,3],'K2':[10,20,30]})
df2 = pd.DataFrame({'K3':[10,2,30],'K4':[11,22,30]})

In [330]:
df1

   K1  K2
0   1  10
1   2  20
2   3  30

In [332]:
df2

   K3  K4
0  10  11
1   2  22
2  30  30

In [338]:
#pd.merge(df1,df2,on='K1')
pd.concat([df1,df2])

    K1    K2    K3    K4
0  1.0  10.0   NaN   NaN
1  2.0  20.0   NaN   NaN
2  3.0  30.0   NaN   NaN
0  NaN   NaN  10.0  11.0
1  NaN   NaN   2.0  22.0
2  NaN   NaN  30.0  30.0

#help(pd.merge)
#pd.merge(df1,df2)

In [346]:
df1.stack()

0  K1     1
   K2    10
1  K1     2
   K2    20
2  K1     3
   K2    30
dtype: int64

In [348]:
df1

   K1  K2
0   1  10
1   2  20
2   3  30

In [350]:
df_csv.stack() # convert column to row

0  eid           101
   ename         ram
   edept       sales
   eplace       pune
   ecost        1000
1  eid           102
   ename         leo
   edept        prod
   eplace     bglore
   ecost        2000
2  eid           103
   ename         anu
   edept          HR
   eplace        hyd
   ecost        3000
3  eid           104
   ename        paul
   edept       sales
   eplace     bglore
   ecost        3200
4  eid           423
   ename         zio
   edept       sales
   eplace       pune
   ecost        3420
5  eid           142
   ename         anu
   edept        prod
   eplace    chennai
   ecost        4300
6  eid           949
   ename     karthik
   edept       sales
   eplace     bglore
   ecost        3100
7  eid           848
   ename         tom
   edept          hr
   eplace    chennai
   ecost        3940
8  eid           931
   ename       vijay
   edept        prod
   eplace    chennai
   ecost        3411
dtype: object

In [352]:
df1

   K1  K2
0   1  10
1   2  20
2   3  30

In [354]:
df1.unstack() # converts row to columns

K1  0     1
    1     2
    2     3
K2  0    10
    1    20
    2    30
dtype: int64

In [ ]:
Data Aggregation
----------------
 range of data //array -> scalar data (Single)
np.max()
np.min()
np.mean()
np.count()

K | V
K1| v1 =>
K2| v2 =>
K3| v3 =>
======
 |->groupby() - group data based on 1 or more columns ->apply aggregation (sum(),mean(),min(),max()..)

In [362]:
d={'K1':['V1','V2','V1','V2','V1'],
   'K2':[10,20,30,40,50],
   'K3':[15,20,25,30,40]
  }
df = pd.DataFrame(d)
print(df)
print('')
df.groupby('K1').sum()

   K1  K2  K3
0  V1  10  15
1  V2  20  20
2  V1  30  25
3  V2  40  30
4  V1  50  40

    K2  K3
K1
V1  90  80
V2  60  50

In [364]:
df.groupby('K1').max()

    K2  K3
K1
V1  50  40
V2  40  30

In [366]:
df.groupby('K1').min()

    K2  K3
K1
V1  10  15
V2  20  20

In [368]:
df.groupby('K1').mean()

      K2         K3
K1
V1  30.0  26.666667
V2  30.0  25.000000

In [372]:
#help(df.groupby('K1').agg)
df.groupby('K1').agg(['min','max'])

    K2      K3
   min max min max
K1
V1  10  50  15  40
V2  20  40  20  30

In [374]:
df.groupby('K1').K2.agg(['min','max'])

    min  max
K1
V1   10   50
V2   20   40

In [376]:
df.groupby('K1').count()

    K2  K3
K1
V1   3   3
V2   2   2

In [378]:
# count total rows in each group
df.groupby('K1').size()

K1
V1    3
V2    2
dtype: int64

In [380]:
df = pd.read_csv('data.csv')
df.shape

(569, 33)

In [ ]:
# 1st 15 rows  ->new_df

# check
   - duplicated 
   -  drop duplicated 
   - drop unwanted columns 
   - rename - column
   - NaN -> column
   - check - duplicated ; NaN

# bool index based 
   - sort_values  - ascending / descending 
   - Aggregate method 
          - sum() min() max() mean()

In [382]:
df_csv

   eid    ename  edept   eplace  ecost
0  101      ram  sales     pune   1000
1  102      leo   prod   bglore   2000
2  103      anu     HR      hyd   3000
3  104     paul  sales   bglore   3200
4  423      zio  sales     pune   3420
5  142      anu   prod  chennai   4300
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [384]:
df_csv['ecost']

0    1000
1    2000
2    3000
3    3200
4    3420
5    4300
6    3100
7    3940
8    3411
Name: ecost, dtype: int64

In [388]:
df_csv['ecost'] >4000

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
Name: ecost, dtype: bool

In [390]:
df_csv[df_csv['ecost'] >4000]

   eid ename edept   eplace  ecost
5  142   anu  prod  chennai   4300

In [392]:
df_csv[df_csv['ecost'] >3000]

   eid    ename  edept   eplace  ecost
3  104     paul  sales   bglore   3200
4  423      zio  sales     pune   3420
5  142      anu   prod  chennai   4300
6  949  karthik  sales   bglore   3100
7  848      tom     hr  chennai   3940
8  931    vijay   prod  chennai   3411

In [394]:
df_csv[1:5]

   eid ename  edept  eplace  ecost
1  102   leo   prod  bglore   2000
2  103   anu     HR     hyd   3000
3  104  paul  sales  bglore   3200
4  423   zio  sales    pune   3420

In [400]:
df_csv[1:5][df_csv['ecost'] >3000]

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\107670044.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_csv[1:5][df_csv['ecost'] >3000]

   eid ename  edept  eplace  ecost
3  104  paul  sales  bglore   3200
4  423   zio  sales    pune   3420

#################

In [402]:
df = pd.read_csv('data.csv')
df.shape

(569, 33)

In [404]:
rows,cols = df.shape
print(f'data set contains {rows}  and {cols} columns')

data set contains 569  and 33 columns

In [406]:
# info about data set
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 33 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       569 non-null    int64
 1   diagnosis                569 non-null    object
 2   radius_mean              569 non-null    float64
 3   texture_mean             569 non-null    float64
 4   perimeter_mean           569 non-null    float64
 5   area_mean                569 non-null    float64
 6   smoothness_mean          569 non-null    float64
 7   compactness_mean         569 non-null    float64
 8   concavity_mean           569 non-null    float64
 9   concave points_mean      569 non-null    float64
 10  symmetry_mean            569 non-null    float64
 11  fractal_dimension_mean   569 non-null    float64
 12  radius_se                569 non-null    float64
 13  texture_se               569 non-null    float64
 14  perimeter_se             569 non-null    float64
 15  area_se                  569 non-null    float64
 16  smoothness_se            569 non-null    float64
 17  compactness_se           569 non-null    float64
 18  concavity_se             569 non-null    float64
 19  concave points_se        569 non-null    float64
 20  symmetry_se              569 non-null    float64
 21  fractal_dimension_se     569 non-null    float64
 22  radius_worst             569 non-null    float64
 23  texture_worst            569 non-null    float64
 24  perimeter_worst          569 non-null    float64
 25  area_worst               569 non-null    float64
 26  smoothness_worst         569 non-null    float64
 27  compactness_worst        569 non-null    float64
 28  concavity_worst          569 non-null    float64
 29  concave points_worst     569 non-null    float64
 30  symmetry_worst           569 non-null    float64
 31  fractal_dimension_worst  569 non-null    float64
 32  Unnamed: 32              0 non-null      float64
dtypes: float64(31), int64(1), object(1)
memory usage: 146.8+ KB

In [408]:
new_df = df.head(15)

In [410]:
new_df.shape

(15, 33)

In [412]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 33 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       15 non-null     int64
 1   diagnosis                15 non-null     object
 2   radius_mean              15 non-null     float64
 3   texture_mean             15 non-null     float64
 4   perimeter_mean           15 non-null     float64
 5   area_mean                15 non-null     float64
 6   smoothness_mean          15 non-null     float64
 7   compactness_mean         15 non-null     float64
 8   concavity_mean           15 non-null     float64
 9   concave points_mean      15 non-null     float64
 10  symmetry_mean            15 non-null     float64
 11  fractal_dimension_mean   15 non-null     float64
 12  radius_se                15 non-null     float64
 13  texture_se               15 non-null     float64
 14  perimeter_se             15 non-null     float64
 15  area_se                  15 non-null     float64
 16  smoothness_se            15 non-null     float64
 17  compactness_se           15 non-null     float64
 18  concavity_se             15 non-null     float64
 19  concave points_se        15 non-null     float64
 20  symmetry_se              15 non-null     float64
 21  fractal_dimension_se     15 non-null     float64
 22  radius_worst             15 non-null     float64
 23  texture_worst            15 non-null     float64
 24  perimeter_worst          15 non-null     float64
 25  area_worst               15 non-null     float64
 26  smoothness_worst         15 non-null     float64
 27  compactness_worst        15 non-null     float64
 28  concavity_worst          15 non-null     float64
 29  concave points_worst     15 non-null     float64
 30  symmetry_worst           15 non-null     float64
 31  fractal_dimension_worst  15 non-null     float64
 32  Unnamed: 32              0 non-null      float64
dtypes: float64(31), int64(1), object(1)
memory usage: 4.0+ KB

In [414]:
# To get list of columns
new_df.columns

Index(['id', 'diagnosis', 'radius_mean', 'texture_mean', 'perimeter_mean',
       'area_mean', 'smoothness_mean', 'compactness_mean', 'concavity_mean',
       'concave points_mean', 'symmetry_mean', 'fractal_dimension_mean',
       'radius_se', 'texture_se', 'perimeter_se', 'area_se', 'smoothness_se',
       'compactness_se', 'concavity_se', 'concave points_se', 'symmetry_se',
       'fractal_dimension_se', 'radius_worst', 'texture_worst',
       'perimeter_worst', 'area_worst', 'smoothness_worst',
       'compactness_worst', 'concavity_worst', 'concave points_worst',
       'symmetry_worst', 'fractal_dimension_worst', 'Unnamed: 32'],
      dtype='object')

In [416]:
new_df.drop(columns=['id','texture_mean', 'perimeter_mean',
       'area_mean', 'smoothness_mean', 'compactness_mean', 'concavity_mean',
       'concave points_mean', 'symmetry_mean', 'fractal_dimension_mean',
       'radius_se', 'texture_se', 'perimeter_se', 'area_se', 'smoothness_se',
       'compactness_se', 'concavity_se', 'concave points_se', 'symmetry_se',
       'fractal_dimension_se', 'radius_worst', 'texture_worst',
       'perimeter_worst', 'area_worst', 'smoothness_worst',
       'compactness_worst', 'concavity_worst',],inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\1643427372.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.drop(columns=['id','texture_mean', 'perimeter_mean',

In [418]:
new_df.columns

Index(['diagnosis', 'radius_mean', 'concave points_worst', 'symmetry_worst',
       'fractal_dimension_worst', 'Unnamed: 32'],
      dtype='object')

In [420]:
new_df['Unnamed: 32']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
Name: Unnamed: 32, dtype: float64

In [422]:
new_df.drop(columns='Unnamed: 32',inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\3912100108.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.drop(columns='Unnamed: 32',inplace=True)

In [424]:
new_df.columns

Index(['diagnosis', 'radius_mean', 'concave points_worst', 'symmetry_worst',
       'fractal_dimension_worst'],
      dtype='object')

In [426]:
new_df.rename(columns={'concave points_worst':'concave','symmetry_worst':'symmetry',
                       'fractal_dimension_worst':'fractal'},inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\2386768332.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.rename(columns={'concave points_worst':'concave','symmetry_worst':'symmetry',

In [428]:
new_df.columns

Index(['diagnosis', 'radius_mean', 'concave', 'symmetry', 'fractal'], dtype='object')

In [430]:
new_df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [432]:
new_df.duplicated().sum()

0

In [ ]:
#new_df.drop_duplicates(inplace=True)

In [434]:
new_df.isnull()

    diagnosis  radius_mean  concave  symmetry  fractal
0       False        False    False     False    False
1       False        False    False     False    False
2       False        False    False     False    False
3       False        False    False     False    False
4       False        False    False     False    False
5       False        False    False     False    False
6       False        False    False     False    False
7       False        False    False     False    False
8       False        False    False     False    False
9       False        False    False     False    False
10      False        False    False     False    False
11      False        False    False     False    False
12      False        False    False     False    False
13      False        False    False     False    False
14      False        False    False     False    False

In [446]:
# To modify an existing cell value 
# df[rowIndex,Column]=UpdatedValue
#
new_df.loc[8,'concave']=None

In [448]:
new_df.isnull()

    diagnosis  radius_mean  concave  symmetry  fractal
0       False        False    False     False    False
1       False        False    False     False    False
2       False        False    False     False    False
3       False        False    False     False    False
4       False        False    False     False    False
5       False        False    False     False    False
6       False        False    False     False    False
7       False        False    False     False    False
8       False        False     True     False    False
9       False        False    False     False    False
10      False        False    False     False    False
11      False        False    False     False    False
12      False        False    False     False    False
13      False        False    False     False    False
14      False        False    False     False    False

In [450]:
new_df.isnull().sum()

diagnosis      0
radius_mean    0
concave        1
symmetry       0
fractal        0
dtype: int64

In [452]:
 new_df.loc[8:,'concave']=None

In [454]:
new_df

   diagnosis  radius_mean  concave  symmetry  fractal
0          M        17.99   0.2654    0.4601  0.11890
1          M        20.57   0.1860    0.2750  0.08902
2          M        19.69   0.2430    0.3613  0.08758
3          M        11.42   0.2575    0.6638  0.17300
4          M        20.29   0.1625    0.2364  0.07678
5          M        12.45   0.1741    0.3985  0.12440
6          M        18.25   0.1932    0.3063  0.08368
7          M        13.71   0.1556    0.3196  0.11510
8          M        13.00      NaN    0.4378  0.10720
9          M        12.46      NaN    0.4366  0.20750
10         M        16.02      NaN    0.2948  0.08452
11         M        15.78      NaN    0.3792  0.10480
12         M        19.17      NaN    0.3176  0.10230
13         M        15.85      NaN    0.2809  0.06287
14         M        13.73      NaN    0.3596  0.14310

In [460]:
new_df.loc[8:12,'concave']=0.5

In [462]:
new_df

   diagnosis  radius_mean  concave  symmetry  fractal
0          M        17.99   0.2654    0.4601  0.11890
1          M        20.57   0.1860    0.2750  0.08902
2          M        19.69   0.2430    0.3613  0.08758
3          M        11.42   0.2575    0.6638  0.17300
4          M        20.29   0.1625    0.2364  0.07678
5          M        12.45   0.1741    0.3985  0.12440
6          M        18.25   0.1932    0.3063  0.08368
7          M        13.71   0.1556    0.3196  0.11510
8          M        13.00   0.5000    0.4378  0.10720
9          M        12.46   0.5000    0.4366  0.20750
10         M        16.02   0.5000    0.2948  0.08452
11         M        15.78   0.5000    0.3792  0.10480
12         M        19.17   0.5000    0.3176  0.10230
13         M        15.85      NaN    0.2809  0.06287
14         M        13.73      NaN    0.3596  0.14310

new_df.loc[8]    - 8th index
new_df.loc[8:]   - 8th index to list of all
new_df.loc[8:12] - 8th index to 12th index

In [464]:
new_df.at[8,'concave']=0.5   #  same as -> new_df.loc[8,'concave']=0.5

In [466]:
new_df

   diagnosis  radius_mean  concave  symmetry  fractal
0          M        17.99   0.2654    0.4601  0.11890
1          M        20.57   0.1860    0.2750  0.08902
2          M        19.69   0.2430    0.3613  0.08758
3          M        11.42   0.2575    0.6638  0.17300
4          M        20.29   0.1625    0.2364  0.07678
5          M        12.45   0.1741    0.3985  0.12440
6          M        18.25   0.1932    0.3063  0.08368
7          M        13.71   0.1556    0.3196  0.11510
8          M        13.00   0.5000    0.4378  0.10720
9          M        12.46   0.5000    0.4366  0.20750
10         M        16.02   0.5000    0.2948  0.08452
11         M        15.78   0.5000    0.3792  0.10480
12         M        19.17   0.5000    0.3176  0.10230
13         M        15.85      NaN    0.2809  0.06287
14         M        13.73      NaN    0.3596  0.14310

In [468]:
new_df.isnull().sum()

diagnosis      0
radius_mean    0
concave        2
symmetry       0
fractal        0
dtype: int64

In [470]:
# replace null value
new_df.fillna(14.5)

   diagnosis  radius_mean  concave  symmetry  fractal
0          M        17.99   0.2654    0.4601  0.11890
1          M        20.57   0.1860    0.2750  0.08902
2          M        19.69   0.2430    0.3613  0.08758
3          M        11.42   0.2575    0.6638  0.17300
4          M        20.29   0.1625    0.2364  0.07678
5          M        12.45   0.1741    0.3985  0.12440
6          M        18.25   0.1932    0.3063  0.08368
7          M        13.71   0.1556    0.3196  0.11510
8          M        13.00   0.5000    0.4378  0.10720
9          M        12.46   0.5000    0.4366  0.20750
10         M        16.02   0.5000    0.2948  0.08452
11         M        15.78   0.5000    0.3792  0.10480
12         M        19.17   0.5000    0.3176  0.10230
13         M        15.85  14.5000    0.2809  0.06287
14         M        13.73  14.5000    0.3596  0.14310

In [474]:
import numpy as np

In [478]:
new_df.loc[13].fillna(np.mean(new_df['concave']/len(new_df)))

diagnosis             M
radius_mean       15.85
concave        0.021217
symmetry         0.2809
fractal         0.06287
Name: 13, dtype: object

new_df.loc[13].fillna(np.mean(new_df['concave']/len(new_df)),inplace=True)

In [492]:
new_df.fillna(np.mean(new_df['concave']/len(new_df)),inplace=True)

C:\Users\theeba\AppData\Local\Temp\ipykernel_16692\4027693621.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.fillna(np.mean(new_df['concave']/len(new_df)),inplace=True)

In [494]:
new_df

   diagnosis  radius_mean   concave  symmetry  fractal
0          M        17.99  0.265400    0.4601  0.11890
1          M        20.57  0.186000    0.2750  0.08902
2          M        19.69  0.243000    0.3613  0.08758
3          M        11.42  0.257500    0.6638  0.17300
4          M        20.29  0.162500    0.2364  0.07678
5          M        12.45  0.174100    0.3985  0.12440
6          M        18.25  0.193200    0.3063  0.08368
7          M        13.71  0.155600    0.3196  0.11510
8          M        13.00  0.500000    0.4378  0.10720
9          M        12.46  0.500000    0.4366  0.20750
10         M        16.02  0.500000    0.2948  0.08452
11         M        15.78  0.500000    0.3792  0.10480
12         M        19.17  0.500000    0.3176  0.10230
13         M        15.85  0.021217    0.2809  0.06287
14         M        13.73  0.021217    0.3596  0.14310

In [496]:
new_df.duplicated().sum()

0

In [498]:
new_df.isnull().sum()

diagnosis      0
radius_mean    0
concave        0
symmetry       0
fractal        0
dtype: int64

In [519]:
d = {"K1":[10,20,30],"K2":[70,80,90],"K1":[70,80,90],"K3":[100,110,120]}
Tdf = pd.DataFrame(d)
Tdf

   K1  K2   K3
0  70  70  100
1  80  80  110
2  90  90  120

In [515]:
# Transposes the dataframe back to original df
Tdf.T.drop_duplicates().T

   K1   K3
0  70  100
1  80  110
2  90  120

In [521]:
new_df.sort_values(by='symmetry')

   diagnosis  radius_mean   concave  symmetry  fractal
4          M        20.29  0.162500    0.2364  0.07678
1          M        20.57  0.186000    0.2750  0.08902
13         M        15.85  0.021217    0.2809  0.06287
10         M        16.02  0.500000    0.2948  0.08452
6          M        18.25  0.193200    0.3063  0.08368
12         M        19.17  0.500000    0.3176  0.10230
7          M        13.71  0.155600    0.3196  0.11510
14         M        13.73  0.021217    0.3596  0.14310
2          M        19.69  0.243000    0.3613  0.08758
11         M        15.78  0.500000    0.3792  0.10480
5          M        12.45  0.174100    0.3985  0.12440
9          M        12.46  0.500000    0.4366  0.20750
8          M        13.00  0.500000    0.4378  0.10720
0          M        17.99  0.265400    0.4601  0.11890
3          M        11.42  0.257500    0.6638  0.17300

In [523]:
new_df.sort_values(by='symmetry',ascending=False)

   diagnosis  radius_mean   concave  symmetry  fractal
3          M        11.42  0.257500    0.6638  0.17300
0          M        17.99  0.265400    0.4601  0.11890
8          M        13.00  0.500000    0.4378  0.10720
9          M        12.46  0.500000    0.4366  0.20750
5          M        12.45  0.174100    0.3985  0.12440
11         M        15.78  0.500000    0.3792  0.10480
2          M        19.69  0.243000    0.3613  0.08758
14         M        13.73  0.021217    0.3596  0.14310
7          M        13.71  0.155600    0.3196  0.11510
12         M        19.17  0.500000    0.3176  0.10230
6          M        18.25  0.193200    0.3063  0.08368
10         M        16.02  0.500000    0.2948  0.08452
13         M        15.85  0.021217    0.2809  0.06287
1          M        20.57  0.186000    0.2750  0.08902
4          M        20.29  0.162500    0.2364  0.07678

In [543]:
# boolean filter 
new_df['concave'] >0.3

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
12     True
13    False
14    False
Name: concave, dtype: bool

In [545]:
new_df[new_df['concave'] >0.3]

   diagnosis  radius_mean  concave  symmetry  fractal
8          M        13.00      0.5    0.4378  0.10720
9          M        12.46      0.5    0.4366  0.20750
10         M        16.02      0.5    0.2948  0.08452
11         M        15.78      0.5    0.3792  0.10480
12         M        19.17      0.5    0.3176  0.10230

In [547]:
new_df.loc[2:10]['radius_mean'] >15

2      True
3     False
4      True
5     False
6      True
7     False
8     False
9     False
10     True
Name: radius_mean, dtype: bool

new_df[new_df.loc[2:10]['radius_mean'] >15]
# not working

In [525]:
new_df.groupby('diagnosis').sum()

           radius_mean   concave  symmetry  fractal
diagnosis
M               240.38  4.179734    5.5275  1.68075

In [527]:
new_df.groupby('diagnosis').max()

           radius_mean  concave  symmetry  fractal
diagnosis
M                20.57      0.5    0.6638   0.2075

In [529]:
new_df.groupby('diagnosis').min()

           radius_mean   concave  symmetry  fractal
diagnosis
M                11.42  0.021217    0.2364  0.06287

In [531]:
new_df.groupby('diagnosis').mean()

           radius_mean   concave  symmetry  fractal
diagnosis
M            16.025333  0.278649    0.3685  0.11205

In [535]:
new_df.groupby('diagnosis').agg(['sum','min','max','mean'])

          radius_mean                            concave                 \
                  sum    min    max       mean       sum       min  max
diagnosis
M              240.38  11.42  20.57  16.025333  4.179734  0.021217  0.5

                    symmetry                          fractal           \
               mean      sum     min     max    mean      sum      min
diagnosis
M          0.278649   5.5275  0.2364  0.6638  0.3685  1.68075  0.06287


              max     mean
diagnosis
M          0.2075  0.11205

In [537]:
new_df.groupby('diagnosis').concave.agg(['sum','min','max','mean'])

                sum       min  max      mean
diagnosis
M          4.179734  0.021217  0.5  0.278649

#################

pd.read_csv
pd.read_sql_query('select *from <table>',<dbConnection>) -> df

In [551]:
import sqlite3
conn = sqlite3.connect('C:\\Users\\theeba\\Dx\\products.db')
if not(conn):
    print('DB connection is failed')
    exit()

In [553]:
bool(conn)

True

In [555]:
pd.read_sql_query('select *from pT',conn)

   pID  pName  pCost
0  101  prodA   1000
1  102  prodB   2000
2  103  prodC   3000

In [557]:
conn = sqlite3.connect('C:\\Users\\theeba\\Dx\\test1.db')
if not(conn):
    print('DB connection is failed')
    exit()

In [559]:
pd.read_sql_query('select *from T1',conn)

    id  appName  port server
0  101    Flask  5000  Linux
1  102   djnago  8080   winx
2  103  fastApi  9090   unix

In [561]:
df_DB=pd.read_sql_query('select *from T1',conn)
df_DB

    id  appName  port server
0  101    Flask  5000  Linux
1  102   djnago  8080   winx
2  103  fastApi  9090   unix

In [563]:
df_DB.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       3 non-null      int64
 1   appName  3 non-null      object
 2   port     3 non-null      int64
 3   server   3 non-null      object
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [565]:
conn = sqlite3.connect('C:\\Users\\theeba\\Dx\\test1.db')
if not(conn):
    print('DB connection is failed')
    exit()

In [567]:
df_DB=pd.read_sql_query('select *from T1',conn)
df_DB

    id  appName  port server
0  101    Flask  5000  Linux
1  102   djnago  8080   winx
2  103  fastApi  9090   unix

In [569]:
conn = sqlite3.connect('C:\\Users\\theeba\\Dx\\test1.db')
if not(conn):
    print('DB connection is failed')
    exit()

In [571]:
df_DB=pd.read_sql_query('select *from T1',conn)
df_DB

    id  appName  port server
0  101    Flask  5000  Linux
1  102   djnago  8080   winx
2  103  fastApi  9090   unix
3  555  testApp  1234  Linux
4  656  demoApp  9393   winx

In [573]:
df_DB.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      int64
 1   appName  5 non-null      object
 2   port     5 non-null      int64
 3   server   5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [577]:
df_DB.index

RangeIndex(start=0, stop=5, step=1)

In [579]:
df_DB.columns

Index(['id', 'appName', 'port', 'server'], dtype='object')

In [581]:
df_DB['server'] == "Linux"

0     True
1    False
2    False
3     True
4    False
Name: server, dtype: bool

In [583]:
df_DB[df_DB['server'] == "Linux"]

    id  appName  port server
0  101    Flask  5000  Linux
3  555  testApp  1234  Linux